#订单类型数据
DanMode = ["订单","急单","充值","代送","活动","售后","补送"]
DanModeImg = ["DingD00.png","DingD01.png","DingD02.png","DingD03.png","DingD04.png","DingD05.png","DingD06.png"]
DanModeID = ["D0","D1","D2","D3","D4","D5","D6"]
#下单人数据
XiaPer= ["YT","TOM","大叔","猪","英","英妹","一一","cvm","宝","莹姐","秋","二叔","Ray","二哥","福","商城","店",\
         "霞姐","排骨","浪","王"]
XiaPerImg = ["XiaD00.png","XiaD01.png","XiaD02.png","XiaD03.png","XiaD04.png","XiaD05.png","XiaD06.png","XiaD07.png",\
             "XiaD08.png","XiaD09.png","XiaD10.png","XiaD11.png","XiaD12.png","XiaD13.png","XiaD14.png","XiaD15.png",\
             "XiaD16.png","XiaD17.png","XiaD18.png","XiaD19.png","XiaD20.png"]
XiaPerID = ["X0","X1","X2","X3","X4","X5","X6","X7","X8","X9","X10","X11","X12","X13","X14","X15",\
            "X16","X17","X18","X19","X20"]
#特殊操作人数据
CaoPer = {"YT":"YT","英":"莹姐"}
SKtype = ["转账","收现","会员卡消费","已转账","POS","月结","商城转账","领用","退款"]
#说明文本---------------------------
mtype ="""\
订单类型
     |
     |__订单-->平时下单人发出来的订单。
     |
     |__急单-->有紧急要求的订单。
     |
     |__充值-->下单要求会员卡充值的订单,金额一般是转账。
     |
     |__代送-->客户或下单人或其他人有需求帮忙送到指定地址的订单,一般会收取运费。
     |
     |__活动-->节假日送礼,符合活动奖励条件的订单。
     |
     |__售后-->接到客户反馈商品有质量问题的订单,一般需要去取回商品,经专员检查、判断后,决定更换商品的订单。
     |
     |__补送-->已出单,未送达的订单
"""
Mxia ="""\
下单人选择栏
    |
    |__经常或偶尔下单的人员,主要是定位 客户信息 和 金额 归属,方便查找。"""
Matt ="""\
订单状态栏-->显示当前的订单类型、订单号、下单人、做单日期 的数据。
    |
    |__订单号-->分为主要 和 补充 两部分:
            |__主要-->当前有多少订单的数量。
            |__次要-->主要调节订单的数量,一般会有一些订单没有记录的,如以前未送的订单，或是重复做单。
"""
Mtxt = """\
订单内容
    |
    |__下单人发出来的未处理过订单内容,只要找到 地址 的信息,在其前后位置 添加上 = 的符号即可,例：=华侨城野人森林=。
"""
Mbc = """\
订单补充内容
        |
        |__补加商品
                |
                |__追加商品-->需添加 ++ 符号在商品前面,即可在原有的商品上追加商品,例：++2斤山竹。
                |
                |__更新商品-->不添加 ++ 在商品前,则将原有的商品替换，例：2斤山竹。
"""
Mchk = """\
订单处理按钮
        |
        |__订单内容处理-->只要按照 订单内容 的要求处理订单,即可点击 订单内容处理。
        |
        |__刷新列表订单-->每次打开程序,最好先点击,获取已记录的订单信息。
        |
        |__添加列表订单-->添加已处理完成的订单,需要在 订单内容 里面开头输入(++需要添加的订单) 或 (通过手工处理完成的订单),点击添加列表订单。
        |
        |__删除列表订单-->删除列表的订单,需要在 订单内容 里面输入 --,再点击 删除 删除列表订单。
        |
        |__呼出界面-->修改以完成的订单内容,在列表中选择需要修改的订单内容,点击鼠标右键,等待内容显示在 订单补充内容 中,需要修改完成后点击 修改列表订单。
                |
                |__ 显示内容-->选择列表的订单后,点击可以将内容对应到所在的地方。
                |
                |__确认更改-->显示所选的订单内容后,进行修改后,点击可以将修改后的内容更新。
"""
Minf = """\
订单处理信息栏
            |
            |__客户手机-->订单内容处理完成后,显示客户的手机信息,如手机信息出现错误,需及时跟下单人联系。
            |
            |__送货地址-->订单内容处理完成后,显示送货地址,如送货地址出现错误,需及时跟下单人联系。
"""
Mlit = """\
订单内容显示列表
            |
            |__订单处理完成后,会显示在列表中。
"""

